dump/travelguru/tg_hotel_provisional_booking_request.xml


   <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"> 
   <soap:Body> 
   <OTA_HotelResRQ xmlns="http://www.opentravel.org/OTA/2003/05" CorrelationID="1234" TransactionIdentifier="122121" Version="1.003"> 
   <POS> 
       <Source ISOCurrency="INR"> 
           <RequestorID MessagePassword="test@123" ID="1000000002"> 
               <CompanyName Code="testsell"></CompanyName> 
           </RequestorID> 
       </Source> 
   </POS>
   <UniqueID Type="" ID="" /> 
   <HotelReservations> 
       <HotelReservation> 
           <RoomStays> 
               <RoomStay> 
                   <RoomTypes> 
                       <RoomType NumberOfUnits="1" RoomTypeCode="0000068444" /> 
                       </RoomTypes> 
                       <RatePlans> 
                           <RatePlan RatePlanCode="0000281922" /> 
                           </RatePlans> 
                           <GuestCounts IsPerRoom="false"> 
                               <GuestCount ResGuestRPH="0" AgeQualifyingCode="10" Count="1" /><GuestCount ResGuestRPH="0" AgeQualifyingCode="8"  Age="5" Count="1" /><GuestCount ResGuestRPH="0" AgeQualifyingCode="8"  Age="3" Count="1" />                               
                           </GuestCounts> 
                           <TimeSpan End="2019-12-25" Start="2019-12-24" /> 
                           <Total AmountBeforeTax="1045" CurrencyCode="INR"> 
                               <Taxes Amount="0" /> 
                               </Total> 
                               <BasicPropertyInfo HotelCode="00020702" /> 
                               <TPA_Extensions>
               <CustomerGST>
                  <GSTNumber></GSTNumber>
                  <GSTCompanyName></GSTCompanyName>
                  <GSTCompanyEmailId></GSTCompanyEmailId>
                  <GSTCompanyAddress></GSTCompanyAddress>
                  <GSTCity></GSTCity>
                  <GSTPinCode></GSTPinCode>
                  <GSTState></GSTState>
                  <GSTPhoneISD></GSTPhoneISD>
                  <GSTPhoneNumber></GSTPhoneNumber>
                  <CustomerName></CustomerName>
                  <CustomerAddress></CustomerAddress>
                  <CustomerState></CustomerState>
                </CustomerGST>
              </TPA_Extensions>
                               <Comments> 
                                   <Comment> 
                                       <Text>No</Text> 
                                   </Comment> 
                               </Comments> 
                           </RoomStay> 
                       </RoomStays> 
                       <ResGuests> 
                           <ResGuest> 
                               <Profiles> 
                                   <ProfileInfo> 
                                       <Profile ProfileType="1"> 
                                           <Customer>
    <PersonName> 
       <NamePrefix>Mr</NamePrefix> 
       <GivenName>pavith</GivenName> 
       <MiddleName></MiddleName> 
       <Surname>p</Surname> 
   </PersonName><Telephone AreaCityCode="80" CountryAccessCode="91" Extension="0" PhoneNumber="9223345678" PhoneTechType="1"/> 
                                            <Email>shiji@travelpd.com</Email> 
                                            <Address> 
                                               <AddressLine>dfdfdfdfdfdfd</AddressLine> 
                                               <AddressLine></AddressLine> 
                                               <CityName>koalla</CityName> 
                                               <PostalCode>567890</PostalCode> 
                                               <StateProv>KA</StateProv> 
                                               <CountryName>India</CountryName> 
                                           </Address> 
                                       </Customer> 
                                   </Profile> 
                               </ProfileInfo> 
                           </Profiles> 
                       </ResGuest> 
                   </ResGuests> 
                   <ResGlobalInfo> 
                       <Guarantee GuaranteeType="PrePay" /> 
                   </ResGlobalInfo>
               </HotelReservation> 
           </HotelReservations> 
           </OTA_HotelResRQ> 
       </soap:Body> 
   </soap:Envelope>    
   